Revit 2024 API
MechanicalSystem.SystemType Property
The type of this duct system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DuctSystemType SystemType { get; }
Visual Basic
Public ReadOnly Property SystemType As DuctSystemType
	Get
Visual C++
public:
property DuctSystemType SystemType {
	DuctSystemType get ();
}
See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace